{
  "meta" : {
    "title": "nutin toolkit",
    "description": "nutin toolkit website (documentation, tutorial)."
  },
  "title": "nutin toolkit",
  "catchphrase": "Build SPAs by understanding SPAs. A minimal frontend toolkit crafted for learning and lean applications.",
  "pitch": "Have you ever wondered what happens under the hood of the frameworks you use daily? nutin started as a learning journey to understand the core concepts that power modern frontend development.\n\nWhile major frameworks excel at complex applications, sometimes you need something simpler for personal projects, prototypes, or educational purposes. nutin gives you the SPA experience without the framework overhead —and more importantly, without the magic.",
  "presentation": "nutin provides the essential building blocks for single-page applications —router, component lifecycle, state management, and event system— all in one lightweight, dependency-light package.\n\nOptional companions:\n• testin-nutin: A simple testing toolkit that grows with your needs\n• stylin-nutin: Tailwind-inspired styling that you can customize\n• deployment helpers : a Dockerfile + Nginx config with secure defaults.\n\nEverything is designed for transparency and tweakability. The code lives in your `src/core/` folder, not hidden in node_modules.",
  "philosophy": "I built nutin to demystify frontend frameworks. By implementing core concepts like reactivity, component lifecycles, and client-side routing from scratch, I gained a deeper understanding of the tools I use.\n\nThis isn't about replacing Vue or Angular —it's about understanding them better. The code is intentionally minimal and accessible because the goal is learning through doing. Every piece is there to examine, modify, and learn from.\n\nPerfect for:\n• Developers wanting to understand framework fundamentals\n• Small projects where full frameworks feel heavy\n• Learning how things work under the hood\n• Situations where you want zero runtime dependencies\n\nThe limitations are features, not bugs. They keep the focus on what's essential.\nI hope you'll enjoy using nutin as much as I enjoyed building it!\n\n",
  "tutorial-link": "👉 Build your first nutin app 👈"
} 