{
	"catchphrase": "Construisez des SPAs en comprenant les SPAs.\nUne boîte à outils frontend minimaliste conçue pour l'apprentissage et les applications légères.",
  "pitch": "Vous êtes-vous déjà demandé ce qui se passe sous le capot des frameworks que vous utilisez au quotidien ?\nnutin a commencé comme un parcours d'apprentissage pour comprendre les concepts fondamentaux qui alimentent le développement frontend moderne.\n\nAlors que les frameworks majeurs excellent dans le développement d'applications complexes, il arrive que l'on souhaite quelque chose de plus simple - pour des projets personnels, des prototypes ou des objectifs éducatifs.\nnutin offre l'expérience SPA sans la surcharge des frameworks —et surtout, sans la magie cachée.",
  "presentation": "nutin fournit les éléments essentiels pour les applications monopages —routeur, cycle de vie des composants, gestion d'état et système d'événements— le tout dans un package léger et avec peu de dépendances.\n\nCompagnons optionnels :\n• testin-nutin : Une boîte à outils de test simple que vous pouvez faire évoluer selon vos besoins\n• stylin-nutin : Un système de style inspiré de Tailwind, personnalisable à loisir\n\nTout est conçu pour la transparence et la personnalisation. Le code vit dans votre dossier `src/core/`, et non caché dans node_modules.",
  "philosophy": "J'ai créé nutin pour démystifier les frameworks frontend. En implémentant à partir de zéro des concepts fondamentaux comme la réactivité, les cycles de vie des composants et le routage côté client, j'ai acquis une compréhension plus profonde des outils que j'utilise chaque jour.\n\nIl ne s'agit pas de remplacer Vue ou Angular —il s'agit de mieux les comprendre. Le code est intentionnellement minimal et accessible car l'objectif est l'apprentissage par la pratique. Chaque élément est là pour être examiné, modifié et compris, afin d'en tirer des enseignements.\n\nParfait pour :\n• Les développeurs souhaitant comprendre les fondamentaux des frameworks\n• Les petits projets où les frameworks complets paraissent trop lourds\n• Apprendre comment les choses fonctionnent sous le capot\n• Les situations où l'on veut zéro dépendance à l'exécution\n\nLes limitations sont des fonctionnalités, pas des bugs. Elles permettent de se concentrer sur l'essentiel.\nJ'espère que vous apprécierez d'utiliser nutin autant que j'ai aimé le développer !\n\n",
  "tutorial-link": "👉 Développez votre première app nutin 👈"
}