{
	"catchphrase": "Une boîte à outils front-end légère et hautement personnalisable, conçue pour créer des applications monopage légères et dynamiques, sans la complexité des frameworks complets.",
	"presentation": "Aussi minimaliste soit-il, nutin propose nativement des fonctionnalités essentielles comme un router, un bus d'évènements, la gestion du cycle de vie des composants, des services singleton...\nVous avez la possibilité d'utiliser le petit outil de test testin-nutin et la bibliothèque 'tailwind-like' stylin-nutin, toutes deux facilement extensibles, afin de pouvoir développer, mettre en forme et tester des applications sans ajouter de dépendances externes.\nnutin propose également quelques outils pour rendre le développement plus fluide, comme des pipes, des guardes de route, un petit système de notification ('snackbar'), etc...",
	"pitch": "Aussi puissant les frameworks soient-ils, leur puissance va de pair avec leur complexité. Peut-être qu'utiliser Angular pour développer un portfolio ou un blog n'aboutit qu'à complexifier inutilement le développement.\nNéanmoins, il est raisonnable de partir du principe que vous souhaitez offir à vos utilisateurs une expérience SPA à laquelle nous sommes habitués de nos jours, tout en pouvant réutiliser des composants et ainsi garder votre code DRY.\nC'est la raison pour laquelle j'ai choisi de développer nutin.",
  "philosophy": "J'ai initialement développé nutin pour mes propres projets personnels, avec une approche aussi pragmatique que possible pour éviter toute complexité inutile.\nLe but n'a jamais été d'être aussi dynamique que Vue ni aussi robuste qu'Angular, mais simplement de rendre le développement d'applications de taille modeste et à la complexité limitée simple et agréable. J'ai choisi de n'utiliser que les dépendances strictement nécessaires pour les étapes de développement et de build, et aucune dépendance en exécution. De manière évidente, cela implique restrictions et limitations, mais cela suit l'esprit même du projet.\nnutin n'est pas une dépendance, tout le code est accessible dans src/core. J'ai cherché à maintenir au mieux la séparation des responsabilités, pour que modifier et étendre cet outil soit aussi accessible que possible.\n\nMerci de m'avoir lu, et j'espère que vous apprécierez d'utiliser nutin autant que j'ai apprécié le développer !",
  "tutorial-link": "👉 Développez votre première app nutin 👈"
}